 # В данном примере выбрана процедурная парадигма, так как она является достаточно простой 
 # и понятной для решения этой задачи. Выбор структурной парадигмы здесь обусловлен тем,
 # что мы организуем программу в логические блоки - функции. 
 # Мы разделяем вывод каждой строки таблицы отдельной функцией, что делает код более читаемым 
 # и облегчает его поддержку и модификацию в будущем.

def print_multiplication_table(n):
    for i in range(1, n+1):
        print_table_row(i)

def print_table_row(row_number):
    for j in range(1, 10):
        result = row_number * j
        print(f"{row_number} * {j} = {result}")

n = int(input("Введите число n: "))
print_multiplication_table(n)
